import math

print("----------------------------------------------")
print("рещение квадратного уравнения вида ax^2+bx+c=0")
print("----------------------------------------------")

a = int(input('a = '))
b = int(input('b = '))
c = int(input('c = '))

print("----------------------------------------------")

d = (b ** 2) - (4 * a * c)
if d > 0:
    print('x1 = ', (-b + math.sqrt(d)) / (2 * a), '   x2 = ', (-b - math.sqrt(d)) / (2 * a))
elif d == 0:
    print('x = ', -b / (2*a))
else :
    print('нет решения')

print("----------------------------------------------")